app/Controllers/DashboardController.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $model = new MProduk();
        $data['produks'] = $model->findAll();

INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`, `image`) VALUES ('KODE 2', 'Susu Frisian Flag', '3000', '1720154222_9b1f0a0b207627e49d36.webp')
---
    public function store()
    {
        $model = new MProduk();
        $data = [
            'kode_produk' => $this->request->getPost('kode_produk'),
            'nama_produk' => $this->request->getPost('nama_produk'),
            'harga' => $this->request->getPost('harga'),
        ];

        // Handle image upload
        $image = $this->request->getFile('image');
        if ($image && $image->isValid() && !$image->hasMoved()) {
            $newName = $image->getRandomName();
            $image->move(ROOTPATH . 'public/uploads', $newName);
            $data['image'] = $newName;
        }

        $model->insert($data);

SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'
---
    public function edit($id)
    {
        $model = new MProduk();
        $data['produk'] = $model->find($id);