app/Controllers/ProdukController.php

INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('A001', 'Realme Smart TV 50 inch', 570000)
SELECT *
FROM `produk`
WHERE `produk`.`id` = 1
---
    public function create()
    {
        $data = [
            "kode_produk" => $this->request->getVar("kode_produk"),
            "nama_produk" => $this->request->getVar("nama_produk"),
            "harga" => $this->request->getVar("harga")
        ];

        // Handle image upload
        $image = $this->request->getFile('image');
        if ($image && $image->isValid() && !$image->hasMoved()) {
            $newName = $image->getRandomName();
            $image->move(WRITEPATH . 'uploads', $newName);
            $data['image'] = $newName;
        }

        $model = new MProduk();
        $model->insert($data);
        $produk = $model->find($model->getInsertID());

SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'
---
    public function detail($id)
    {
        $model = new MProduk();
        $produk = $model->find($id);