app/Controllers/ProdukController.php

    public function hapus($id){
        $model = new MProduk () ;
        $produk = $model->delete($id) ;
---
DELETE FROM `produk`
WHERE `id` IN ('1')